Revit 2027 API
BuiltInFailures.SketchFailures.InvalidProfile Property
 One or more profiles are invalid. Make sure that every used profile is a closed loop of non-intersecting lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidProfile { get; }
Public Shared ReadOnly Property InvalidProfile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidProfile {
	FailureDefinitionId^ get ();
}
static member InvalidProfile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace